'use strict';

export const OPENDOTA_MIN_REQUEST_FREQ_MS = 500;
export const OPENDOTA_MAX_RETRIES = 3;

export const MATCH_POLL_INTERVAL_MS = 60 * 1000;
export const MATCH_RECENT_THRESHOLD_MS = 60 * 60 * 1000;

export const DISCORD_BOSS_ID = "407971834689093632";
export const BIBA_MIN_SIZE = 1;
export const BIBA_BOSS_MIN_SIZE = 18;
export const BIBA_MAX_SIZE = 30;

export const MMR_MIN = 1;
export const MMR_BOSS_MIN = 2000;
export const MMR_MAX = 8000;

export const CACHE_EXP_PROFILE_MS = 60 * 60 * 1000;
export const CACHE_EXP_HEROES_MS = 24 * 60 * 60 * 1000;

export const SWEARS = [
  '%s, добра б тобі не було!',
  '%s, щоб в тебе пір\'я в роті поросло!',
  '%s, ти хуй.',
  'Трясця твоїй матері, %s!',
  'А щоб швидкою Настею тут тебе зносило, %s',
  'А щоби тобі нижче пояса зціпило за пупа, %s',
  '%s, щоб твоєю мордою просо молотили',
  '%s, щоб твоя дружинонька з кумом повелася',
  'Щоби твоя срака по шву розійшлася, %s',
  '%s, щоб ти щастя не знав',
  '%s, щоб ти луснув',
  '%s, щоб тобі заціпило',
  'А щоб тобі повилазило, %s',
  'А щоб ти всрався, як маленький був, %s',
  'Щоб тебе підняло і гепнуло, %s',
  'А щоб тебе грім побив, %s',
  'А щоб тебе злидні обсіли, %s',
  'Бодай тебе чорти вхопили, %s',
  '%s, щоб ти падло дристало та й дристало',
  'А щоб тобі булька з носа вискочила, %s',
  'А щоб тобі курка на ногу наступила, %s',
  '%s, щоб тобі рачки лазити',
  '%s, щоб ти скис!',
  '%s, щоб ти сказився!',
  'Сто чортів тобі в печінку, %s',
  'Іди до бісової матері, %s',
  'Дурний тебе піп хрестив, %s',
  '%s, ти, гімно нероздушене!',
  '%s, ти курва гойдана!',
  '%s, ти блазень',
  '%s, ти бовдур',
  '%s, ти бусурман',
  '%s, ти вилупок',
  '%s, ти вишкребок',
  '%s, ти волоцюга',
  '%s, ти гаспид',
  '%s, ти дурбелик',
  '%s, ти злидень',
  '%s, ти йолоп',
  '%s, ти лайдак',
  '%s, ти лярва',
  '%s, ти наволоч',
  '%s, ти плюгавий',
  '%s, ти срака',
  '%s, ти телепень',
  '%s, ти тюхтій',
  '%s, ти хвойда',
  '%s, ти шльондра',
  '%s, ти шмаркач'
];