'use strict';

import { CommandBase } from './command';
import { Message } from 'discord.js';
import { format } from 'util';

export default class SwearCommand extends CommandBase {
  public process(message: Message) {
    super.process(message);
    message.mentions.users.forEach(user => message.channel.send(format(this.swears[this.random(0, this.swears.length)], user.toString())));
  }

  private swears = [
    '%s, добра б тобі не було!',
    '%s, щоб в тебе пір\'я в роті поросло!',
    '%s, ти хуй.',
    'Трясця твоїй матері, %s!',
    'А щоб швидкою Настею тут тебе зносило, %s',
    'А щоби тобі нижче пояса зціпило за пупа, %s',
    '%s, щоб твоєю мордою просо молотили',
    '%s, щоб твоя дружинонька з кумом повелася',
    'Щоби твоя срака по шву розійшлася, %s',
    '%s, щоб ти щастя не знав',
    '%s, щоб ти луснув',
    '%s, щоб тобі заціпило',
    'А щоб тобі повилазило, %s',
    'А щоб ти всрався, як маленький був, %s',
    'Щоб тебе підняло і гепнуло, %s',
    'А щоб тебе грім побив, %s',
    'А щоб тебе злидні обсіли, %s',
    'Бодай тебе чорти вхопили, %s',
    '%s, щоб ти падло дристало та й дристало',
    'А щоб тобі булька з носа вискочила, %s',
    'А щоб тобі курка на ногу наступила, %s',
    '%s, щоб тобі рачки лазити',
    '%s, щоб ти скис!',
    '%s, щоб ти сказився!',
    'Сто чортів тобі в печінку, %s',
    'Іди до бісової матері, %s',
    'Дурний тебе піп хрестив, %s',
    '%s, ти, гімно нероздушене!',
    '%s, ти блазень',
    '%s, ти бовдур',
    '%s, ти бусурман',
    '%s, ти вилупок',
    '%s, ти вишкребок',
    '%s, ти волоцюга',
    '%s, ти гаспид',
    '%s, ти дурбелик',
    '%s, ти злидень',
    '%s, ти йолоп',
    '%s, ти лайдак',
    '%s, ти лярва',
    '%s, ти наволоч',
    '%s, ти плюгавий',
    '%s, ти срака',
    '%s, ти телепень',
    '%s, ти тюхтій',
    '%s, ти хвойда',
    '%s, ти шльондра',
    '%s, ти шмаркач'
  ];
}